plskeggs/sdk-nrf/samples/nrf9160/nrf_cloud_coap_client/src/main.c
	err_cbor = cbor_value_get_double(&map_value, &lat);
	if (err_cbor != CborNoError) {
		LOG_ERR("Error getting lat: %d", err_cbor);
		return -EBADMSG;
	}

	err_cbor = cbor_value_get_double(&map_value, &lon);
	if (err_cbor != CborNoError) {
		LOG_ERR("Error getting lon: %d", err_cbor);
		return -EBADMSG;
	}

	err_cbor = cbor_value_get_double(&map_value, &uncertainty);
	if (err_cbor != CborNoError) {
		LOG_ERR("Error getting uncertainty: %d", err_cbor);
		return -EBADMSG;
	}

	/* Exit array */
	err_cbor = cbor_value_leave_container(&value, &map_value);
	if (err_cbor != CborNoError) {
		return -EACCES;
	}

	snprintf(temp_buf, temp_size - 1, "fulfilledWith:%s, lat:%g, lon:%g, unc:%g\n",
	       fulfilled_with, lat, lon, uncertainty);

	return 0;
}

static int encode_cbor_sensor(double value, int64_t ts, uint8_t *buf, size_t *len)
{
	struct cbor_buf_writer wr_encoder;
	struct CborEncoder encoder;
	CborEncoder array_encoder;

	cbor_buf_writer_init(&wr_encoder, buf, *len);
	cbor_encoder_init(&encoder, &wr_encoder.enc, 0);

	cbor_encoder_create_array(&encoder, &array_encoder, 2);
	cbor_encode_double(&array_encoder, value);
	cbor_encode_uint(&array_encoder, ts);
	cbor_encoder_close_container(&encoder, &array_encoder);

	*len = cbor_buf_writer_buffer_size(&wr_encoder, buf);
	LOG_HEXDUMP_DBG(buf, *len, "CBOR TEMP");

	return 0;
}

#if defined(CELL_POS_PAYLOAD)
static int encode_cbor_cell_pos(bool do_reply, unsigned int mcc, unsigned int mnc, unsigned int eci,
				unsigned int tac, float rsrp, float rsrq, unsigned int earfcn,
				uint8_t *buf, size_t *len)
{
	struct cbor_buf_writer wr_encoder;
	struct CborEncoder encoder;
	CborEncoder array_encoder;

	cbor_buf_writer_init(&wr_encoder, buf, *len);
	cbor_encoder_init(&encoder, &wr_encoder.enc, 0);

	cbor_encoder_create_array(&encoder, &array_encoder, 8);
	cbor_encode_uint(&array_encoder, eci);
	cbor_encode_uint(&array_encoder, mcc);
	cbor_encode_uint(&array_encoder, mnc);
	cbor_encode_uint(&array_encoder, tac);
	cbor_encode_float(&array_encoder, rsrp);
	cbor_encode_float(&array_encoder, rsrq);
	cbor_encode_uint(&array_encoder, earfcn);
	cbor_encode_boolean(&array_encoder, do_reply);
	cbor_encoder_close_container(&encoder, &array_encoder);

	*len = cbor_buf_writer_buffer_size(&wr_encoder, buf);
	LOG_HEXDUMP_DBG(buf, *len, "CBOR CELL_POS");

	return 0;
}
#endif

/**@brief Send CoAP ACK or RST response. */
static int client_response(struct coap_packet *req,
			   const char *resource, uint16_t mid,
			   uint16_t token_len, uint8_t *token, bool ack)
{
	int err;
	struct coap_packet response;
	enum coap_msgtype msg_type = ack ? COAP_TYPE_ACK : COAP_TYPE_RESET;

	err = coap_packet_init(&response, coap_buf, sizeof(coap_buf),
			       APP_COAP_VERSION, msg_type,
			       token_len, token, 0, mid);
	if (err < 0) {
		LOG_ERR("Failed to create CoAP response, %d", err);
		return err;
	}

	if (resource && strlen(resource)) {
		err = coap_packet_append_option(&response, COAP_OPTION_URI_PATH,
						(uint8_t *)resource,
						strlen(resource));
		if (err < 0) {
			LOG_ERR("Failed to encode CoAP option, %d", err);
			return err;
		}
	}

	err = send(sock, response.data, response.offset, 0);
	if (err < 0) {
		LOG_ERR("Failed to send CoAP response, %d", -errno);
		return -errno;
	}

	printk("CoAP %s response sent: token 0x%04x\n", coap_types[msg_type], next_token);

	return 0;
}

/**@brief Handles responses from the remote CoAP server. */
static int client_handle_get_response(enum nrf_cloud_coap_response expected_response,
				      uint8_t *buf, int received)
{
	int err;
	struct coap_packet reply;
	struct coap_option options[16] = {};
	int count;
	const uint8_t *payload;
	uint16_t payload_len;
	uint8_t token[8] = {0};
	uint16_t token_len;
	uint8_t temp_buf[100];
	char uri_path[64];
	enum coap_content_format format = 0;
	uint16_t message_id;
	uint8_t code;
	uint8_t type;
	struct nrf_cloud_coap_message *msg = NULL;

	err = coap_packet_parse(&reply, buf, received, NULL, 0);
	if (err < 0) {
		LOG_ERR("Malformed response received: %d", err);
		goto done;
	}

	token_len = coap_header_get_token(&reply, token);
	message_id = coap_header_get_id(&reply);
	code = coap_header_get_code(&reply);
	type = coap_header_get_type(&reply);
	
	if (type > COAP_TYPE_RESET) {
		LOG_ERR("Illegal CoAP type: %u", type);
		err = -EINVAL;
		goto done;
	}

	count = ARRAY_SIZE(options) - 1;
	count = coap_find_options(&reply, COAP_OPTION_URI_PATH,
				   options, count);
	if (count > 1) {
		LOG_ERR("Unexpected number of URI path options: %d", count);
		err = -EINVAL;
		goto done;
	} else if (count == 1) {
		memcpy(uri_path, options[0].value, options[0].len);
		uri_path[options[0].len] = '\0';
	} else {
		uri_path[0] = '\0';
	}

	LOG_INF("Got response uri:%s, code:0x%02x, type:%u %s, MID:%u, token:0x%02x%02x (len %u)",
		uri_path, code, type, coap_types[type], message_id,
		token[1], token[0], token_len);

	err = -ENOMSG;
	SYS_DLIST_FOR_EACH_CONTAINER(&con_messages, msg, node) {
		LOG_DBG("mid:%u, token:0x%02x%02x", msg->message_id, msg->token[1], msg->token[0]);
		if ((type == COAP_TYPE_CON) || (type == COAP_TYPE_NON_CON)) {
			/* match token only */
			if ((token_len == msg->token_len) &&
			    (memcmp(msg->token, token, token_len) == 0)) {
				LOG_INF("Matched token");
				err = 0;
				break;
			}
		} else { /* ACK or RESET */
			/* EMPTY responses: match MID only */
			if (code == 0) { 
				if (msg->message_id == message_id) {
					LOG_INF("Matched empty %s.",
						(type == COAP_TYPE_ACK) ? "ACK" : "RESET");
					err = 0;
					break;
				}
			} else {
				if ((msg->message_id == message_id) &&
				    (token_len == msg->token_len) &&
				    (memcmp(msg->token, token, token_len) == 0)) {
					LOG_INF("Found MID and token");
					err = 0;
					break;
				}
			}
		}
	}
	if (err) {
		LOG_ERR("No match for message and token");
		LOG_INF("Sending RESET to server");
		err = client_response(&reply, NULL, message_id, 0, NULL, false);
		if (err) {
			goto done;
		}
	} else if (type == COAP_TYPE_CON) {
		LOG_INF("ACKing a CON from server");
		err = client_response(&reply, uri_path, message_id, token_len, token, true);
		if (err) {
			goto done;
		}
	}

	count = ARRAY_SIZE(options) - 1;
	count = coap_find_options(&reply, COAP_OPTION_CONTENT_FORMAT,
				   options, count);
	if (count > 1) {
		LOG_ERR("Unexpected number of content format options: %d", count);
		err = -EINVAL;
		goto done;
	} else if (count == 1) {
		if (options[0].len == 0) {
			format = COAP_CONTENT_FORMAT_TEXT_PLAIN;
		} else if (options[0].len > 1) {
			LOG_ERR("Unexpected content format length: %d", options[0].len);
			err = -EINVAL;
			goto done;
		} else {
			format = options[0].value[0];
		}
		printk("Content format: %d\n", format);
	}

