plskeggs/sdk-nrf/samples/nrf9160/nrf_cloud_coap_client/src/main.c
	payload = coap_packet_get_payload(&reply, &payload_len);
	if (payload_len > 0) {
		if (format == COAP_CONTENT_FORMAT_APP_CBOR) {
			err = decode_cbor_response(expected_response, payload, payload_len,
						   temp_buf, sizeof(temp_buf));
			if (err) {
				goto done;
			}
		} else {
			snprintf(temp_buf, MIN(payload_len + 1, sizeof(temp_buf)), "%s", payload);
			printk("CoAP payload: %s\n", temp_buf);
		}
	} else {
		printk("CoAP payload: EMPTY\n");
	}

done:
	if (msg != NULL) {
		sys_dlist_remove(&msg->node);
		k_free(msg);
		num_con_messages--;
		LOG_INF("messages left:%d", num_con_messages);
	}
	return err;
}

/**@brief Send CoAP GET request. */
static int client_get_send(const char *resource, uint8_t *buf, size_t len)
{
	int err;
	int i;
	int num;
	struct coap_packet request = {0};
	uint8_t format = COAP_CONTENT_FORMAT_APP_CBOR;
	uint16_t message_id = coap_next_id();
	enum coap_msgtype msg_type = COAP_TYPE_CON;
	struct nrf_cloud_coap_message *msg;

	next_token++;

	err = coap_packet_init(&request, coap_buf, sizeof(coap_buf),
			       APP_COAP_VERSION, msg_type,
			       sizeof(next_token), (uint8_t *)&next_token,
			       COAP_METHOD_GET, message_id);
	if (err < 0) {
		LOG_ERR("Failed to create CoAP request, %d", err);
		return err;
	}

	err = coap_packet_append_option(&request, COAP_OPTION_URI_PATH,
					(uint8_t *)resource,
					strlen(resource));
	if (err < 0) {
		LOG_ERR("Failed to encode CoAP option, %d", err);
		return err;
	}

	if (buf) {
		err = coap_packet_append_option(&request, COAP_OPTION_CONTENT_FORMAT,
						&format, sizeof(format));
		if (err < 0) {
			LOG_ERR("Failed to encode CoAP content format option, %d", err);
			return err;
		}

		err = coap_packet_append_payload_marker(&request);
		if (err < 0) {
			LOG_ERR("Failed to add CoAP payload marker, %d", err);
			return err;
		}

		err = coap_packet_append_payload(&request, buf, len);
		if (err < 0) {
			LOG_ERR("Failed to add CoAP payload, %d", err);
			return err;
		}
	}

	err = send(sock, request.data, request.offset, 0);
	if (err < 0) {
		LOG_ERR("Failed to send CoAP request, errno %d, err %d, sock %d, request.data %p, request.offset %u",
			-errno, err, sock, request.data, request.offset);
		return -errno;
	}

	num = (msg_type == COAP_TYPE_CON) ? 2 : 1;
	for (i = 0; i < num; i++) {
		msg = k_malloc(sizeof(struct nrf_cloud_coap_message));
		if (msg) {
			sys_dnode_init(&msg->node);
			msg->message_id = message_id;
			memcpy(msg->token, &next_token, sizeof(next_token));
			msg->token_len = sizeof(next_token);
			sys_dlist_append(&con_messages, &msg->node);
			num_con_messages++;
			LOG_INF("Added MID:%u, token:0x%04x to list; len:%d",
				message_id, next_token, num_con_messages);
		}
	}
	printk("CoAP request sent: MID:%u, token:0x%04x\n", message_id, next_token);
	//client_print_connection_id(sock, true);

	return 0;
}

/**@biref Send CoAP POST request. */
static int client_post_send(const char *resource, uint8_t *buf, size_t buf_len)
{
	int err;
	struct coap_packet request = {0};
	uint8_t format = COAP_CONTENT_FORMAT_APP_CBOR;
	uint16_t message_id = coap_next_id();
	enum coap_msgtype msg_type = COAP_TYPE_CON;
	struct nrf_cloud_coap_message *msg;

	next_token++;

	err = coap_packet_init(&request, coap_buf, sizeof(coap_buf),
			       APP_COAP_VERSION, msg_type,
			       sizeof(next_token), (uint8_t *)&next_token,
			       COAP_METHOD_POST, message_id);
	if (err < 0) {
		LOG_ERR("Failed to create CoAP request, %d", err);
		return err;
	}

	err = coap_packet_append_option(&request, COAP_OPTION_URI_PATH,
					(uint8_t *)resource,
					strlen(resource));
	if (err < 0) {
		LOG_ERR("Failed to encode CoAP URI option, %d", err);
		return err;
	}

	err = coap_packet_append_option(&request, COAP_OPTION_CONTENT_FORMAT,
					&format, sizeof(format));
	if (err < 0) {
		LOG_ERR("Failed to encode CoAP content format option, %d", err);
		return err;
	}

	err = coap_packet_append_payload_marker(&request);
	if (err < 0) {
		LOG_ERR("Failed to add CoAP payload marker, %d", err);
		return err;
	}

	err = coap_packet_append_payload(&request, buf, buf_len);
	if (err < 0) {
		LOG_ERR("Failed to add CoAP payload, %d", err);
		return err;
	}

	err = send(sock, request.data, request.offset, 0);
	if (err < 0) {
		LOG_ERR("Failed to send CoAP request, errno %d, err %d, sock %d, request.data %p, request.offset %u",
			-errno, err, sock, request.data, request.offset);
		return -errno;
	}

	if (msg_type == COAP_TYPE_CON) {
		/* we expect an ACK back from the server */
		msg = k_malloc(sizeof(struct nrf_cloud_coap_message));
		if (msg) {
			sys_dnode_init(&msg->node);
			msg->message_id = message_id;
			memcpy(msg->token, &next_token, sizeof(next_token));
			msg->token_len = sizeof(next_token);
			sys_dlist_append(&con_messages, &msg->node);
			num_con_messages++;
			LOG_INF("Added MID:%u, token:0x%04x to list; len:%d",
				message_id, next_token, num_con_messages);
		}
	}

	printk("CoAP request sent: MID:%u, token:0x%04x\n", message_id, next_token);
	//client_print_connection_id(sock, true);

	return 0;
}

#if defined(CONFIG_LWM2M_CARRIER)
K_SEM_DEFINE(carrier_registered, 0, 1);

void lwm2m_carrier_event_handler(const lwm2m_carrier_event_t *event)
{
	switch (event->type) {
	case LWM2M_CARRIER_EVENT_BSDLIB_INIT:
		printk("LWM2M_CARRIER_EVENT_BSDLIB_INIT\n");
		break;
	case LWM2M_CARRIER_EVENT_CONNECT:
		printk("LWM2M_CARRIER_EVENT_CONNECT\n");
		break;
	case LWM2M_CARRIER_EVENT_DISCONNECT:
		printk("LWM2M_CARRIER_EVENT_DISCONNECT\n");
		break;
	case LWM2M_CARRIER_EVENT_READY:
		printk("LWM2M_CARRIER_EVENT_READY\n");
		k_sem_give(&carrier_registered);
		break;
	case LWM2M_CARRIER_EVENT_FOTA_START:
		printk("LWM2M_CARRIER_EVENT_FOTA_START\n");
		break;
	case LWM2M_CARRIER_EVENT_REBOOT:
		printk("LWM2M_CARRIER_EVENT_REBOOT\n");
		break;
	}
}
#endif /* defined(CONFIG_LWM2M_CARRIER) */

K_SEM_DEFINE(lte_ready, 0, 1);

static void lte_handler(const struct lte_lc_evt *const evt)
{
	switch (evt->type) {
	case LTE_LC_EVT_NW_REG_STATUS:
		if ((evt->nw_reg_status == LTE_LC_NW_REG_REGISTERED_HOME) ||
		    (evt->nw_reg_status == LTE_LC_NW_REG_REGISTERED_ROAMING)) {
			LOG_INF("Connected to LTE network");
			k_sem_give(&lte_ready);
		} else {
			LOG_INF("reg status %d", evt->nw_reg_status);
		}
		break;

	default:
		LOG_INF("LTE event %d (0x%x)", evt->type, evt->type);
		break;
	}
}


