plskeggs/sdk-nrf/samples/nrf9160/nrf_cloud_coap_client/src/main.c
#if !defined(CONFIG_COAP_DTLS_PSK)
#if defined(CONFIG_NET_SOCKETS_OFFLOAD_PRIORITY)
	err = nrf_cloud_jwt_generate(JWT_DURATION_S, jwt, sizeof(jwt));
	if (err) {
		goto exit;
	}
#else
	err = jwt_generate(JWT_DURATION_S, jwt, sizeof(jwt));
#endif
	err = client_post_send("/auth-jwt", (uint8_t *)jwt, sizeof(jwt));
	if (err) {
		goto exit;
	}
#endif
	while (1) {
		if (k_uptime_get() >= next_msg_time) {
			if (reconnect) {
				reconnect = false;
				printk("Going online\n");
				err = lte_lc_normal();
				if (err) {
					LOG_ERR("Error going online: %d", err);
				} else {
					k_sem_take(&lte_ready, K_FOREVER);
					if (client_init() != 0) {
						printk("Failed to initialize CoAP client\n");
						return;
					}
				}
			}

			ts = k_uptime_get();
			err = date_time_uptime_to_unix_time_ms(&ts);
			if (err) {
				LOG_ERR("Error converting time: %d", err);
			}

			toggle = !toggle;
			if (toggle) {
				len = sizeof(buffer);
				encode_cbor_sensor(temp, ts, buffer, &len);

				printk("\n%d. Calling client_put_send()\n", put_count++);
				if (client_post_send(post_res, buffer, len) != 0) {
					printk("Failed to send POST request, exit...\n");
					break;
				}
			} else {
	#if defined(CELL_POS_PAYLOAD)
				len = sizeof(buffer);
				encode_cbor_cell_pos(true, 260, 310, 21858829, 333,
						     -157.0F, -34.5F, 0, buffer, &len);
				get_payload = buffer;
	#else
				get_payload = NULL;
				len = 0;
	#endif
				printk("\n%d. Calling client_get_send()\n", get_count++);
				if (client_get_send(get_res, get_payload, len) != 0) {
					printk("Failed to send GET request, exit...\n");
					break;
				}
			}

			delta_ms = APP_COAP_SEND_INTERVAL_MS * i;
			LOG_INF("Next transfer in %d minutes, %d seconds",
				delta_ms / 60000, (delta_ms / 1000) % 60);
			next_msg_time += delta_ms;
#if defined(DELAY_INTERPACKET_PERIOD)
			if (++i > APP_COAP_INTERVAL_LIMIT) {
				i = APP_COAP_INTERVAL_LIMIT;
			}
#endif
#if defined(CONFIG_COAP_DTLS)
			client_print_connection_id(sock, false);
#endif
		}

		if (reconnect) {
			k_sleep(K_MSEC(APP_COAP_RECEIVE_INTERVAL_MS));
			check_connection();
			continue;
		}
		err = wait(APP_COAP_RECEIVE_INTERVAL_MS);
		if (err < 0) {
			if (err == -EAGAIN) {
				check_connection();
				continue;
			}

			printk("Poll error, exit...\n");
			break;
		}

		printk("Calling recv()\n");
		received = recv(sock, coap_buf, sizeof(coap_buf), MSG_DONTWAIT);
		if (received < 0) {
			if (errno == EAGAIN || errno == EWOULDBLOCK) {
				printk("socket EAGAIN\n");
				continue;
			} else {
				printk("Socket error, exit...\n");
				break;
			}
		}

		if (received == 0) {
			printk("Empty datagram\n");
			continue;
		}

		printk("Calling client_handle_get_response()\n");
		err = client_handle_get_response(expected_response, coap_buf, received);
		if (err < 0) {
			printk("Invalid response, exit...\n");
			break;
		}

#if defined(OPEN_AND_SHUT)
		if (delta_ms > APP_COAP_CLOSE_THRESHOLD_MS) {
			reconnect = true;
			err = close(sock);
			if (err) {
				LOG_ERR("Error closing socket: %d", err);
			} else {
				printk("Socket closed.\n");
			}
			printk("Going offline\n");
			err = lte_lc_offline();
			if (err) {
				LOG_ERR("Error going offline: %d", err);
			} else {
			}
		}
#endif
	}
exit:
	(void)close(sock);
}
